# Series

In [19]:
import pandas as pd
import numpy as np

In [20]:
## Series creation

##series1 = pd.Series(data,index = idx)  ## syntax of series creation

##creating series using a Nunmpy array

np.random.seed(2)
s = pd.Series(np.random.rand(4), index = [21,22,23,24])
s

21    0.435995
22    0.025926
23    0.549662
24    0.435322
dtype: float64

In [21]:
s.index

Int64Index([21, 22, 23, 24], dtype='int64')

In [22]:
import calendar as cal

In [23]:
name_of_month = [cal.month_name[i] for i in np.arange(6,12)]
month_of_year = pd.Series(np.arange(6,12),index = name_of_month)
month_of_year

June          6
July          7
August        8
September     9
October      10
November     11
dtype: int32

In [24]:
month_of_year.index

Index(['June', 'July', 'August', 'September', 'October', 'November'], dtype='object')

In [25]:
## Using dictionary to create series

dict1 = {'France':'Euro','India':'Rupee','Japan':'Yen','UK':'Pound'}
s_1 = pd.Series(dict1)
s_1

France     Euro
India     Rupee
Japan       Yen
UK        Pound
dtype: object

In [26]:
s_1.index

Index(['France', 'India', 'Japan', 'UK'], dtype='object')

In [27]:
import pandas as pd

In [28]:
## Using Scalar Values to create series

orchids = pd.Series('Dendrobium',index = ['name','species_name','size'])
orchids

name            Dendrobium
species_name    Dendrobium
size            Dendrobium
dtype: object

In [29]:
dist = {'HCL': 3456.65, 'TCS': 3586.52,'Microsoft': 3572.67,'Google': 3769.74,'Blue Ocean': 3476.67}
company = pd.Series(dist)
company

HCL           3456.65
TCS           3586.52
Microsoft     3572.67
Google        3769.74
Blue Ocean    3476.67
dtype: float64

In [30]:
## Arrange the index value in some order

In [31]:
company.index

Index(['HCL', 'TCS', 'Microsoft', 'Google', 'Blue Ocean'], dtype='object')

In [32]:
ser = {'b':22, 'a':73,'d':52,'c':98}
e = pd.Series(ser,index = ['a','c','d','b'])
e

a    73
c    98
d    52
b    22
dtype: int64

In [33]:
## Operations on series

company['Google'] # Or comapany[3]

3769.74

In [34]:
company['Google'] = 9989.93 # or we can used company[3] = 9989.93
company

HCL           3456.65
TCS           3586.52
Microsoft     3572.67
Google        9989.93
Blue Ocean    3476.67
dtype: float64

In [35]:
company['Wipro']

KeyError: 'Wipro'

In [ ]:
## Slicing the Series

company[0:2] # company[:2]

In [36]:
## logical slicing

ex = company[company > 3500]
ex

TCS          3586.52
Microsoft    3572.67
Google       9989.93
dtype: float64

In [37]:
## Statistics operation on Series

In [38]:
import numpy as np

In [39]:
np.mean(company) ## giving the average of the series

4816.488

In [40]:
np.median(company) ## value of company['Microsoft']

3572.67

In [41]:
company

HCL           3456.65
TCS           3586.52
Microsoft     3572.67
Google        9989.93
Blue Ocean    3476.67
dtype: float64

In [42]:
## Creating the series using array() function

arr1 = np.array([1,2,3,4])
ser1 = pd.Series(arr1)
ser1

0    1
1    2
2    3
3    4
dtype: int32

In [43]:
ser2 = ser1 * ser1 ## Multiplying the series itself
ser2

0     1
1     4
2     9
3    16
dtype: int32

In [44]:
np.power(ser2,2)

0      1
1     16
2     81
3    256
dtype: int32

In [45]:
ser1[1:] ## Slicing the series ser1 without first one

1    2
2    3
3    4
dtype: int32

In [46]:
ser1[:-1] ## Slicing the series ser1 without last one

0    1
1    2
2    3
dtype: int32

In [47]:
# print(company[1:])
aa = company[1:]
# print(company[:-1])
ab = company[:-1]
z = aa + ab
print(z)
type(z)

Blue Ocean         NaN
Google        19979.86
HCL                NaN
Microsoft      7145.34
TCS            7173.04
dtype: float64

pandas.core.series.Series

# Data Frame

In [48]:
## Creating dictionary having series

st1 = {'HCL': pd.Series([3456.65,4355.34,6774.45]), 'TCS': pd.Series([3586.52,7655.65,4326.65]),'Microsoft': pd.Series([3572.67,4755.65,5464.56]),'Google': pd.Series([3769.74,4556.65,5636.56]),'Blue Ocean': pd.Series([6456.65,5664.64,3476.67])}
st1

{'HCL': 0    3456.65
 1    4355.34
 2    6774.45
 dtype: float64, 'TCS': 0    3586.52
 1    7655.65
 2    4326.65
 dtype: float64, 'Microsoft': 0    3572.67
 1    4755.65
 2    5464.56
 dtype: float64, 'Google': 0    3769.74
 1    4556.65
 2    5636.56
 dtype: float64, 'Blue Ocean': 0    6456.65
 1    5664.64
 2    3476.67
 dtype: float64}

In [49]:
## Creating dataframe based on dictionary having series

df = pd.DataFrame(st1)
df

       HCL      TCS  Microsoft   Google  Blue Ocean
0  3456.65  3586.52    3572.67  3769.74     6456.65
1  4355.34  7655.65    4755.65  4556.65     5664.64
2  6774.45  4326.65    5464.56  5636.56     3476.67

In [50]:
## Creating dictionary having list

list1 = {'HCL': list([3456.65,4355.34,6774.45]), 'TCS': list([3586.52,7655.65,4326.65]),'Microsoft': list([3572.67,4755.65,5464.56])}
list1

{'HCL': [3456.65, 4355.34, 6774.45],
 'TCS': [3586.52, 7655.65, 4326.65],
 'Microsoft': [3572.67, 4755.65, 5464.56]}

In [51]:
df1 = pd.DataFrame(list1)
df1

       HCL      TCS  Microsoft
0  3456.65  3586.52    3572.67
1  4355.34  7655.65    4755.65
2  6774.45  4326.65    5464.56

In [52]:
df.columns

Index(['HCL', 'TCS', 'Microsoft', 'Google', 'Blue Ocean'], dtype='object')

In [53]:
df['HCL']

0    3456.65
1    4355.34
2    6774.45
Name: HCL, dtype: float64

In [54]:
## operation on dataframe
import numpy as np
df2 = np.zeros((4,),dtype = [('Name','U25'),('Gender','U10'),('Present/Absent','U15')])
df2

array([('', '', ''), ('', '', ''), ('', '', ''), ('', '', '')],
      dtype=[('Name', '<U25'), ('Gender', '<U10'), ('Present/Absent', '<U15')])

In [55]:

df2[:] = [('Ram','Male','Present'),('Priya','Female','Present'),('Arthan','Male','Present'),('Ananaya','Female','Absent')]
df2

array([('Ram', 'Male', 'Present'), ('Priya', 'Female', 'Present'),
       ('Arthan', 'Male', 'Present'), ('Ananaya', 'Female', 'Absent')],
      dtype=[('Name', '<U25'), ('Gender', '<U10'), ('Present/Absent', '<U15')])

In [56]:
import pandas as pd
df3 = pd.DataFrame(df2)
df3

      Name  Gender Present/Absent
0      Ram    Male        Present
1    Priya  Female        Present
2   Arthan    Male        Present
3  Ananaya  Female         Absent

In [57]:
import numpy as np
import pandas as pd

In [58]:
## creating dataframe from a series

st1 = {'INFY':567.12,'TCS':345.34,'Wipro':564.45,'HCL':45.15,'L&T':678.00}
series = pd.Series(st1,index = ['INFY','TCS','Wipro','HCL','L&T'])
series

INFY     567.12
TCS      345.34
Wipro    564.45
HCL       45.15
L&T      678.00
dtype: float64

In [59]:
df4 = pd.DataFrame(series)
df4

            0
INFY   567.12
TCS    345.34
Wipro  564.45
HCL     45.15
L&T    678.00

In [60]:
st2 = {'INFY':600,'TCS':700,'Wipro':500,'HCL':300,'L&T':900}
series1 = pd.Series(st2,index = ['INFY','TCS','Wipro','HCL','L&T'])
series1

INFY     600
TCS      700
Wipro    500
HCL      300
L&T      900
dtype: int64

In [61]:
df5 = pd.DataFrame(series1)
df5

         0
INFY   600
TCS    700
Wipro  500
HCL    300
L&T    900

In [62]:
ser3 = pd.concat([series,series1],axis = 1)
df2 = pd.DataFrame(ser3)
df2

            0    1
INFY   567.12  600
TCS    345.34  700
Wipro  564.45  500
HCL     45.15  300
L&T    678.00  900

In [64]:
df2.columns = ['Day1','Day2']
df2

         Day1  Day2
INFY   567.12   600
TCS    345.34   700
Wipro  564.45   500
HCL     45.15   300
L&T    678.00   900

In [69]:
x = df2['Day1']
print(x)
type(x)

INFY     567.12
TCS      345.34
Wipro    564.45
HCL       45.15
L&T      678.00
Name: Day1, dtype: float64

pandas.core.series.Series

In [70]:
del df2['Day1']  # Or df2.pop('day1')
df2

       Day2
INFY    600
TCS     700
Wipro   500
HCL     300
L&T     900

In [75]:
df2.insert(3,'AC',[450,500,600,750,456])
df2

       Day2  ABC  DXC   AC
INFY    600  450  450  450
TCS     700  450  450  500
Wipro   500  450  450  600
HCL     300  450  450  750
L&T     900  450  450  456

In [76]:
## Basic Indexing

oil_data = {'France':{'2015-Q1':100.1,'2015-Q2':104.9,'2015-Q3':400,'2015-Q4':368.7},
           'Germany':{'2015-Q1':110.1,'2015-Q2':156.9,'2015-Q3':250,'2015-Q4':278.7},
           'Poland':{'2015-Q1':99.1,'2015-Q2':103.9,'2015-Q3':150,'2015-Q4':458.7}}
oil_data

{'France': {'2015-Q1': 100.1,
  '2015-Q2': 104.9,
  '2015-Q3': 400,
  '2015-Q4': 368.7},
 'Germany': {'2015-Q1': 110.1,
  '2015-Q2': 156.9,
  '2015-Q3': 250,
  '2015-Q4': 278.7},
 'Poland': {'2015-Q1': 99.1,
  '2015-Q2': 103.9,
  '2015-Q3': 150,
  '2015-Q4': 458.7}}

In [77]:
oil_df = pd.DataFrame.from_dict(oil_data)
oil_df

         France  Germany  Poland
2015-Q1   100.1    110.1    99.1
2015-Q2   104.9    156.9   103.9
2015-Q3   400.0    250.0   150.0
2015-Q4   368.7    278.7   458.7

In [78]:
oil_df1 = pd.DataFrame(oil_data)
oil_df1

         France  Germany  Poland
2015-Q1   100.1    110.1    99.1
2015-Q2   104.9    156.9   103.9
2015-Q3   400.0    250.0   150.0
2015-Q4   368.7    278.7   458.7

In [79]:
oil_df['France']

2015-Q1    100.1
2015-Q2    104.9
2015-Q3    400.0
2015-Q4    368.7
Name: France, dtype: float64

In [81]:
oil_df[['Poland','Germany','France']]

         Poland  Germany  France
2015-Q1    99.1    110.1   100.1
2015-Q2   103.9    156.9   104.9
2015-Q3   150.0    250.0   400.0
2015-Q4   458.7    278.7   368.7

In [82]:
oil_df.Poland

2015-Q1     99.1
2015-Q2    103.9
2015-Q3    150.0
2015-Q4    458.7
Name: Poland, dtype: float64

In [84]:
oil_df.shape ## How much big the dataframe

(4, 3)

In [87]:
oil_df.head() ## Another way to view the dataframe

         France  Germany  Poland
2015-Q1   100.1    110.1    99.1
2015-Q2   104.9    156.9   103.9
2015-Q3   400.0    250.0   150.0
2015-Q4   368.7    278.7   458.7

In [88]:
### Label oriented indexing

snow_data = {'Months':['january','february','march','april','may','june'],
            'Avg low temp':[26,34,25,45,23,21],
            'Avg precip':[17.8,12.3,11.7,34,12.3,11.5],
            'Avg snowdays':[3.0,6.0,5.0,2.0,3.3,4.5]}
snow_df = pd.DataFrame(snow_data,index = snow_data['Months'],columns=['Avg low temp','Avg precip','Avg snowdays'])
snow_df

          Avg low temp  Avg precip  Avg snowdays
january             26        17.8           3.0
february            34        12.3           6.0
march               25        11.7           5.0
april               45        34.0           2.0
may                 23        12.3           3.3
june                21        11.5           4.5

In [89]:
snow_df.loc['january']

Avg low temp    26.0
Avg precip      17.8
Avg snowdays     3.0
Name: january, dtype: float64

In [91]:
snow_df.loc[['january','june']]

         Avg low temp  Avg precip  Avg snowdays
january            26        17.8           3.0
june               21        11.5           4.5

In [93]:
snow_df['Avg low temp']['january']  #Basic indexing ## df[col][row]

26

In [100]:
snow_df.loc['january','Avg low temp']  #Label indexing ## df[row][col]

26

In [101]:
snow_df.loc[:,'Avg low temp']  ##df[row,col]

january     26
february    34
march       25
april       45
may         23
june        21
Name: Avg low temp, dtype: int64

In [102]:
snow_df.loc['january']['Avg low temp']

26.0

In [104]:
oil_data = {'France':{'2015-Q1':100.1,'2015-Q2':104.9,'2015-Q3':400,'2015-Q4':368.7},
           'Germany':{'2015-Q1':110.1,'2015-Q2':156.9,'2015-Q3':250,'2015-Q4':278.7},
           'Poland':{'2015-Q1':99.1,'2015-Q2':103.9,'2015-Q3':150,'2015-Q4':458.7}}
oil_df = pd.DataFrame(oil_data)
oil_df

         France  Germany  Poland
2015-Q1   100.1    110.1    99.1
2015-Q2   104.9    156.9   103.9
2015-Q3   400.0    250.0   150.0
2015-Q4   368.7    278.7   458.7

In [105]:
type(oil_df)

pandas.core.frame.DataFrame

In [124]:
for i in oil_df.loc['2015-Q1']:
    if i > 100:
        print(i)

100.1
110.1

In [120]:
oil_df.loc['2015-Q1']>100

France      True
Germany     True
Poland     False
Name: 2015-Q1, dtype: bool

In [121]:
oil_df.loc[:,oil_df.loc['2015-Q1']>100]

         France  Germany
2015-Q1   100.1    110.1
2015-Q2   104.9    156.9
2015-Q3   400.0    250.0
2015-Q4   368.7    278.7

In [3]:
## Integer oriented indexing

z = {'x':[1,2,3,4,5],'y':[11,12,13,14,15],'z':[21,22,23,24,25]}
z

{'x': [1, 2, 3, 4, 5], 'y': [11, 12, 13, 14, 15], 'z': [21, 22, 23, 24, 25]}

In [4]:
import pandas as pd
x1 = pd.DataFrame(z,index=list(range(0,10,2)))
x1

   x   y   z
0  1  11  21
2  2  12  22
4  3  13  23
6  4  14  24
8  5  15  25

In [17]:
x1.isnull().sum()/x1.shape[0]*100

x    0.0
y    0.0
z    0.0
dtype: float64

In [129]:
x1[:2]

   x   y   z
0  1  11  21
2  2  12  22

In [130]:
x1[:3]

   x   y   z
0  1  11  21
2  2  12  22
4  3  13  23

In [135]:
x1.iloc[:2]

   x   y   z
0  1  11  21
2  2  12  22

In [138]:
x1['x']

0    1
2    2
4    3
6    4
8    5
Name: x, dtype: int64

In [139]:
x1.loc[2]

x     2
y    12
z    22
Name: 2, dtype: int64

In [140]:
x1.iloc[2]

x     3
y    13
z    23
Name: 4, dtype: int64

In [141]:
x1.iloc[2,0:2]

x     3
y    13
Name: 4, dtype: int64

In [143]:
x1.loc[2]

x     2
y    12
z    22
Name: 2, dtype: int64

In [144]:
%timeit x1.iloc[3,0]

9.59 s  188 ns per loop (mean  std. dev. of 7 runs, 100000 loops each)

In [146]:
%timeit x1.iat[3,0]

5.9 s  260 ns per loop (mean  std. dev. of 7 runs, 100000 loops each)

In [147]:
x1.iat[3,0]

4

In [149]:
x1.iloc[3,0]

4

In [150]:
## Boolean indexing

In [156]:
stock_prices = pd.read_csv("C:/Users/Administrator/Downloads/stock_index_prices.csv")
stock_prices

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
0   2014/02/21      open  4282.17  1841.07       1166.25
1   2014/02/21     close  4263.41  1836.25       1164.63
2   2014/02/21      high  4284.85  1846.13       1168.43
3   2014/02/24      open  4273.32  1836.78       1166.74
4   2014/02/24     close  4292.97  1847.61       1174.55
5   2014/02/24      high  4311.13  1858.71       1180.29
6   2014/02/25      open  4298.48  1847.66       1176.00
7   2014/02/25     close  4287.59  1845.12       1173.95
8   2014/02/25      high  4307.51  1852.91       1179.43
9   2014/02/26      open  4300.45  1845.79       1176.11
10  2014/02/26     close  4292.06  1845.16       1181.72
11  2014/02/26      high  4316.82  1852.65       1188.06
12  2014/02/27      open  4291.47  1844.90       1179.28
13  2014/02/27     close  4318.93  1854.29       1187.94
14  2014/02/27      high  4322.46  1854.53       1187.94
15  2014/02/28      open  4323.52  1855.12       1189.19
16  2014/02/28     close  4308.12  1859.45       1183.03
17  2014/02/28      high  4342.59  1867.92       1193.50

In [162]:
stock_prices.loc[(stock_prices.loc[:,'PriceType']=='close') & (stock_prices.loc[:,'Nasdaq']>4000)]

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
1   2014/02/21     close  4263.41  1836.25       1164.63
4   2014/02/24     close  4292.97  1847.61       1174.55
7   2014/02/25     close  4287.59  1845.12       1173.95
10  2014/02/26     close  4292.06  1845.16       1181.72
13  2014/02/27     close  4318.93  1854.29       1187.94
16  2014/02/28     close  4308.12  1859.45       1183.03

In [163]:
stock_prices.ix[(stock_prices.loc[:,'PriceType']=='close') & (stock_prices.loc[:,'Nasdaq']>4000)]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
1   2014/02/21     close  4263.41  1836.25       1164.63
4   2014/02/24     close  4292.97  1847.61       1174.55
7   2014/02/25     close  4287.59  1845.12       1173.95
10  2014/02/26     close  4292.06  1845.16       1181.72
13  2014/02/27     close  4318.93  1854.29       1187.94
16  2014/02/28     close  4308.12  1859.45       1183.03

In [164]:
## Select all rows where pricetype = high and nasdaq <4300

In [165]:
## isin & any or all (demonstrate)
## where
## mask

In [1]:
import pandas as pd

In [2]:
?pd.DataFrame.isin